Classes | Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::PortBase Class Reference
MEP Element Manager
The Port is associated to an element and it represents a point between elements. More...
#include <MEPPortBase.hpp>
 Inheritance diagram for ACAPI::MEP::PortBase:
 Classes
class  | Modifier
Modifier of the PortBase. More...
 Public Member Functions
bool  | Exists () const
GS::UniString  | GetName () const
Orientation  | GetOrientation () const
double  | GetWidth () const
double  | GetHeight () const
ConnectorShape  | GetShape () const
API_Coord3D  | GetPosition () const
Domain  | GetDomain () const
API_AttributeIndex  | GetMEPSystem () const
std::optional< UniqueID >  | GetConnectedPortId () const
std::optional< UniqueID >  | GetConnectedMEPElementId () const
UniqueID  | GetMEPElementId () const
bool  | IsPhysicallyConnected () const
Result< bool >  | IsPhysicallyConnectable (const UniqueID &portId) const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
PortBase (std::shared_ptr< Impl::IPortBaseImpl > impl)
Constructs a PortBase with the given port base implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The Port is associated to an element and it represents a point between elements.
Since
Archicad 27
Example code snippet from Test / New MEP
Getters
 Reporter portReporter;
 portReporter.Add ("Ports:");
 portReporter.SetTabCount (1);
 for (const UniqueID& portID : mepElem.GetPortIDs ()) {
 portReporter.SetTabCount (1);
 Port::Get (portID).Then ([&](const Port& port) {
 portReporter.Add ("Port name", port.GetName ());
 portReporter.Add ("Port width", port.GetWidth ());
 portReporter.Add ("Port height", port.GetHeight ());
 portReporter.Add ("Port position", port.GetPosition ());
 portReporter.Add ("Port domain", port.GetDomain ());
 portReporter.Add ("Port shape", port.GetShape ());
 portReporter.Add ("Port Orientation - direction vector", port.GetOrientation ().direction);
 portReporter.Add ("Port Orientation - rotation vector", port.GetOrientation ().rotation);
 portReporter.Add ("Port MEP System", port.GetMEPSystem ());
 port.IsPhysicallyConnected () ? portReporter.Add ("Port is connected with another port.") : portReporter.Add ("Port is not connected with another port.");
 if (port.IsPhysicallyConnected ()) {
 Port::Get (*port.GetConnectedPortId ()).Then ([&](const Port& port) {
 portReporter.Add ("Connected port's name", port.GetName ());
 });
 portReporter.Add ("Details about connected element:");
 portReporter.SetTabCount (2);
 Element::Get (*port.GetConnectedMEPElementId ()).Then ([&](const Element& element) {
 Orientation orientation = element.GetOrientation ();
 portReporter.Add ("Id", element.GetElemId ());
 portReporter.Add ("Anchor point", element.GetAnchorPoint ());
 portReporter.Add ("Orientation - direction vector", orientation.direction);
 portReporter.Add ("Orientation - rotation vector", orientation.rotation);
 });
 }
 });
 VentilationPort::Get (portID).Then ([&](const VentilationPort& port) {
 portReporter.Add ("Port wall thickness", port.GetWallThickness ());
 portReporter.Add ("Port flow direction", port.GetFlowDirection ());
 });
 PipingPort::Get (portID).Then ([&](const PipingPort& port) {
 portReporter.Add ("Port wall thickness", port.GetWallThickness ());
 portReporter.Add ("Port diameter", port.GetOuterDiameter ());
 portReporter.Add ("Port flow direction", port.GetFlowDirection ());
 });
 portReporter.Add ("- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -");
 }
 portReporter.Write ();
 Modification
 ACAPI::Result<Element> mepElem = Element::Get (id);
 if (mepElem.IsErr ()) {
 ACAPI_WriteReport (mepElem.UnwrapErr ().text.c_str (), false);
 return mepElem.UnwrapErr ().kind;
 }
 for (const UniqueID& portID : mepElem->GetPortIDs ()) {
 ACAPI::Result<Port> port = Port::Get (portID);
 ACAPI::Result<void> modifyPortResult = (*port).Modify ([&portID](Port::Modifier& modifier) {
 modifier.SetShape (ConnectorShape::Circular);
 modifier.SetWidth (0.35);
 ACAPI::Result<VentilationPort> ventilationPort = VentilationPort::Get (portID);
 if (ventilationPort.IsOk ()) {
 ventilationPort->Modify ([](VentilationPort::Modifier& modifier) {
 modifier.SetWallThickness (0.004);
 modifier.SetFlowDirection (FlowDirection::FlowIn);
 }, "Ventilation port modification.");
 }
 ACAPI::Result<PipingPort> pipingPort = PipingPort::Get (portID);
 if (pipingPort.IsOk ()) {
 pipingPort->Modify ([](PipingPort::Modifier& modifier) {
 modifier.SetWallThickness (0.008);
 modifier.SetFlowDirection (FlowDirection::FlowOut);
 }, "Piping port modification.");
 }
 }, "Port modification.");
 }
 return NoError;
Constructor & Destructor Documentation
◆ PortBase()
 ACAPI::MEP::PortBase::PortBase  |  ( |  std::shared_ptr< Impl::IPortBaseImpl > |  impl | )
protected
Constructs a PortBase with the given port base implementation.
Parameters
impl | The port base implementation.
Member Function Documentation
◆ Exists()
 bool ACAPI::MEP::PortBase::Exists  |  ( |   | ) |   const
Returns
Checks if the Port still exists.
◆ GetConnectedMEPElementId()
 std::optional< UniqueID > ACAPI::MEP::PortBase::GetConnectedMEPElementId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the connected MEP element, if there is any.
◆ GetConnectedPortId()
 std::optional< UniqueID > ACAPI::MEP::PortBase::GetConnectedPortId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the connected port, if there is any.
◆ GetDomain()
 Domain ACAPI::MEP::PortBase::GetDomain  |  ( |   | ) |   const
The domain of the port can differ from the domain of the element that it belongs to, for ex. in case of Equipments.
Returns
Returns the domain of the Port.
◆ GetHeight()
 double ACAPI::MEP::PortBase::GetHeight  |  ( |   | ) |   const
Returns
Returns the height of the Port.
◆ GetMEPElementId()
 UniqueID ACAPI::MEP::PortBase::GetMEPElementId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the MEP element it belongs to.
◆ GetMEPSystem()
 API_AttributeIndex ACAPI::MEP::PortBase::GetMEPSystem  |  ( |   | ) |   const
Returns
Returns the AttributeIndex of the MEPSystem attribute to which it belongs.
◆ GetName()
 GS::UniString ACAPI::MEP::PortBase::GetName  |  ( |   | ) |   const
Returns
Returns the name of the port which you would see on the user interface.
◆ GetOrientation()
 Orientation ACAPI::MEP::PortBase::GetOrientation  |  ( |   | ) |   const
Returns
Returns the orientation of the Port, which is based on a direction vector and a rotation vector.
◆ GetPosition()
 API_Coord3D ACAPI::MEP::PortBase::GetPosition  |  ( |   | ) |   const
Returns
Returns the middle point of the Port.
◆ GetShape()
 ConnectorShape ACAPI::MEP::PortBase::GetShape  |  ( |   | ) |   const
Returns
Returns the shape of the Port.
◆ GetWidth()
 double ACAPI::MEP::PortBase::GetWidth  |  ( |   | ) |   const
Returns
Returns the width of the Port.
◆ IsPhysicallyConnectable()
 Result< bool > ACAPI::MEP::PortBase::IsPhysicallyConnectable  |  ( |  const UniqueID & |  portId | ) |   const
Checks if the Port is physically connectable to another Port. Beside
Domain
MEP System
Position
Orientation which are only enough to obtain a logical connection, there are a few other Port settings that need to match perfectly in order to obtain a Port-Port physical connection and they are the following:
Shape
Dimensions
ConnectionType (this is a GDL parameter, so it can be checked and modified through API_AddParType)
Parameters
portId | The UniqueID of the Port to check against.
Returns
Returns an error if the parameter does not identify a Port, otherwise the result of the check.
◆ IsPhysicallyConnected()
 bool ACAPI::MEP::PortBase::IsPhysicallyConnected  |  ( |   | ) |   const
Returns
Returns if the port is physically connected to another port.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::PortBase::Modify  |  ( |  const ModifierFunc & |  modifierFunc,
|  const GS::UniString & |  undoString )
Executes the passed modifier scope in an Undoable command.
Ports of RoutingElement subElements (RigidSegment, Elbow, Transition) cannot be directly modified. Please use the RoutingElement's Segment and Node default parameters for customization.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.